---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.FieldDomainPointsByXYZ
source: html/d1fd10bf-082a-25b9-1a57-7dde2326e254.htm
---
# FieldDomainPointsByXYZ Properties

Specifies whether the .NET object represents a valid Revit entity.